<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Dropbox and imports into Munki.

Postinstall script extracts the DropboxHelperInstaller and sets the setuid
bit so that it can perform its setup tasks as root without asking for admin
privileges.

Dropbox will attempt to update periodically, and if it does not have permission to
overwrite the bundle at /Applications/Dropbox.app, it will instead download
the updated version to ~/Library/Application Support/Dropbox, and run this version
as long as it is more recent than the copy in /Applications.

This recipe uses blocking_applications to prevent the installation only if Dropbox
from /Applications is running. If an updated version from the user's home directory
is running, Munki can update the version in /Applications without requiring the user
to quit Dropbox.</string>
    <key>Identifier</key>
    <string>com.github.ewancolyer1.munki.editshareconnect</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/editshareconnect</string>
        <key>NAME</key>
        <string>Dropbox</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing v2</string>
            </array>
            <key>description</key>
            <string>Use Editshare Connect to mount the revavent directorys on the server</string>
            <key>display_name</key>
            <string>EditShare Connect</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.ewancolyer1.download.editshareconnect</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>blocking_applications</key>
                    <array>
                        <string>/Applications/EditShare Connect.app/Contents/MacOS/EditShare Connect</string>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>