<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Installs the latest version of NewTek NDI Tools.</string>
		<key>Identifier</key>
		<string>com.github.ewancolyer1.install.NewTekNDITools/string>
			<key>Input</key>
			<dict>
				<key>NAME</key>
				<string>NewTek NDI Tools</string>
			</dict>
			<key>MinimumVersion</key>
			<string>1.0.0</string>
			<key>ParentRecipe</key>
			<string>com.github.ewancolyer1.download.NewTekNDITools</string>
			<key>Process</key>
			<array>
				<dict>
					<key>Arguments</key>
					<dict>
						<key>dmg_path</key>
						<string>%pathname%</string>
						<key>items_to_copy</key>
						<array>
							<dict>
								<key>destination_path</key>
								<string>/Applications</string>
								<key>source_item</key>
								<string>NewTek NDI Tools.app</string>
							</dict>
						</array>
					</dict>
					<key>Processor</key>
					<string>InstallFromDMG</string>
				</dict>
			</array>
		</dict>
	</plist>
