<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Fusion Studio and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ewancolyer1.munki.FusionStudio</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Fusion Studio 1.3</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Fusion Studio</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>goproapp.fusiondevicedetection.app</string>
				<string>Fusion Studio 1.3.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Take your edits to the next level. From streamlined offloading and advanced editing to adding effects and sharing, GoPro Fusion Studio is packed with the tools you need to transform your Fusion content into pro-quality videos, photos and VR stories. </string>
			<key>developer</key>
			<string>GoPro, Inc.</string>
			<key>display_name</key>
			<string>Fusion Studio</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ewancolyer1.download.FusionStudio</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
