<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of EditShare Connect.</string>
		<key>Identifier</key>
		<string>com.github.ewancolyer.download.EditShareConnect</string>
		<key>Input</key>
		<dict>
			<key>IP_ADDRESS</key>
			<string>INSERT_IP_ADDRESS_HERE</string>
			<key>DOWNLOAD_URL</key>
			<string>http://%IP_ADDRESS%/clients/ESC/Install%20EditShare%20Connect%20v7.2.3.4-20191125.223654.f3600ae~7.2.3.pkg</string>
			<key>NAME</key>
			<string>EditShare Connect</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.pkg</string>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Editshare LLC (URJUZJ3GCG)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
